ck/app/controllers/company_controller.rb

SELECT  "companies".* FROM "companies" WHERE (id = '1')  ORDER BY "companies"."id" ASC LIMIT 1
---
  def show
  	com_id = params[:id]
  	@com = Company.where(["id = ?", com_id]).first