ck/app/controllers/home_controller.rb

SELECT "companies".* FROM "companies" WHERE (ma_ck in (select ma_ck from company_businesses where ma_nganh =1) and san_ck = '2')
---
	def index
    @data_companies = Company.all